roniererezende/NXP_MCU_Projects/Test_NPX/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTD1 (number 58), KEY
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_KEY_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_KEY_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_KEY_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_KEY_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_KEY_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_KEY_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTD0 (number 57), BLUE_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_BLUE_LED_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_BLUE_LED_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_BLUE_LED_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_BLUE_LED_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_BLUE_LED_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_BLUE_LED_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTD2 (number 59), RED_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_RED_LED_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_RED_LED_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_RED_LED_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_RED_LED_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_RED_LED_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_RED_LED_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTD3 (number 60), WHITE_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_WHITE_LED_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_WHITE_LED_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_WHITE_LED_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_WHITE_LED_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_WHITE_LED_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_WHITE_LED_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORTD4 (number 61), GREEN_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_GREEN_LED_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_GREEN_LED_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_GREEN_LED_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_GREEN_LED_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_GREEN_LED_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_GREEN_LED_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORTB0 (number 35), ADC_TRIM
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_ADC_TRIM_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_ADC_TRIM_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_ADC_TRIM_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTA13 (number 29), J1[10]/D4-TPM1_CH1/D4-LED_BLUE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED_BLUE_FGPIO FGPIOA              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_LED_BLUE_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_BLUE_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED_BLUE_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_BLUE_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_LED_BLUE_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORTB18 (number 41), J2[11]/D11[1]/LED_RED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED_RED_FGPIO FGPIOB              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_LED_RED_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_RED_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED_RED_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_RED_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_LED_RED_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTB19 (number 42), J2[13]/D11[4]/LED_GREEN
  @{ */

